app/controllers/permission_controller.rb

  def index
    @student = Student.create(first_name: "Truong", last_name: "Nguyen", username: "truong", password: "truong", sex: "M", phone: "0947158258", email: "nctruong861990@gmail.com", avatar: "D:", student_level: "0", country: "Vietnam", birthday: "08/06/1990")
---
INSERT INTO `students` (`first_name`, `last_name`, `username`, `password`, `sex`, `phone`, `email`, `avatar`, `student_level`, `country`, `birthday`, `created_at`, `updated_at`) VALUES ('Truong', 'Nguyen', 'truong', 'truong', 'M', '0947158258', 'nctruong861990@gmail.com', 'D:', 0, 'Vietnam', '1990-06-08 00:00:00', '2016-08-13 09:24:10', '2016-08-13 09:24:10')