app/controllers/students_controller.rb

INSERT INTO `students` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('fdfd', 'dfdf', '2016-08-15 15:23:39', '2016-08-15 15:23:39')
---
  def create
    @student = Student.create(student_params)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = NULL LIMIT 1
---
  def edit
    @student = Student.find(id_param)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = NULL LIMIT 1
---
  def show
    @student = Student.find(id_param)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = NULL LIMIT 1
UPDATE `students` SET `first_name` = 'abc', `updated_at` = '2016-08-15 17:09:03' WHERE `students`.`id` = 32
---
  def update
    @student = Student.find(id_param)

    if @student.update(student_params)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 5 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 5
---
  def destroy
    @student = Student.find(id_param)
    @student.destroy

SELECT  `students`.* FROM `students` WHERE `students`.`email` IS NULL LIMIT 1
---
  def finish_signup
    if request.patch? && params[:student]
      #if @student.update(student_params)
       # sign_in(@student, bypass: true)
      @student = FormStudent.find_by_email(student_params[:email])