app/controllers/student_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`id` = NULL LIMIT 1
---
  def edit
    @student = Student.find(params[:id])

SELECT  `students`.* FROM `students` WHERE `students`.`id` = NULL LIMIT 1
---
  def show
    @student = Student.find(params[:id])